# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
# 3 conv layers so we use 3 anchors
# Detects small, medium and large objects
# Each pair of two values specifies ratio of scales - 3 per anchor
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # From: which layers do we get input to this layer from (-1 denotes previous layer)
  # Number: number of times the module is repeated
  # Module name
  # Module arguments

  # Conv Layer Arguments:   C_in, C_out, KernelSize = 1, stride = 1, padding = None
  # C3 Layer Arguments:     C_in, C_out, n (num_repeat) = 1, shortcut = True
  # SPPF Layer Arguments:   C_in, C_out, KernelSize = 5
  # Upsample Arguments:     Size, Scale_Factor, Mode
  # Concat Layer Arguments: Dimension = 1
  # Detect Layer Arguments: num_classes, out_channels,

  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, InceptionModule, [128]], # 2
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, InceptionModule, [256]], # 4
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, InceptionModule, [512]], # 6
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, InceptionModule, [1024]], # 8
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]], # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 11
    [[-1, 5], 1, Addition, [2]], # 12
    [[-1, 6], 1, Concat, [1]], # 13 - cat backbone P4
    [-1, 3, InceptionModule, [512]], # 14

    [-1, 1, Conv, [256, 1, 1]], # 15
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 16
    [[-1, 3], 1, Addition, [2]], # 17
    [[-1, 4], 1, Concat, [1]], # 18 - cat backbone P3
    [-1, 3, InceptionModule, [256]], # 19 (P3/8-small)

    [[-1, 3], 1, Addition, [2]], # 20

    [-1, 1, Conv, [256, 3, 2]], # 21
    [[-1, 15], 1, Concat, [1]], # 22 - cat head P4
    [-1, 3, InceptionModule, [512]], # 23 (P4/16-medium)

    [[-1, 5], 1, Addition, [2]], # 24

    [-1, 1, Conv, [512, 3, 2]], # 25
    [[-1, 10], 1, Concat, [1]], # 26 - cat head P5
    [-1, 3, InceptionModule, [1024]], # 27 (P5/32-large)

    [[19, 23, 27], 1, Detect, [nc]], # Detect(P3, P4, P5)
  ]
